__author__ = 'Шишкин Анатолий Васильевич'
'''
1. В диапазоне натуральных чисел от 2 до 99 определить, сколько из них кратны каждому из чисел в диапазоне от 2 до 9.
'''

count_dict = {
    '2': 0,
    '3': 0,
    '4': 0,
    '5': 0,
    '6': 0,
    '7': 0,
    '8': 0,
    '9': 0,
}

for i in range(2, 100):
    for key in count_dict.keys():
        if i % int(key) == 0:
            count_dict[key] += 1

print('В диапазоне натуральных чисел от 2 до 99 кратных:')
for key, value in count_dict.items():
    print(f'{key} - {value} чисел')
